Repository: GE-Developer/VOID
Catalog: VOID/Resources/Localizable.xcstrings
Source language: en
Languages: ar, az, be, bn, ca, cs, da, de, el, es, fi, fr, he, hi, hr, hu, hy, id, is, it, ja, ka, kk, ko, ky, ms, nb, nl, pl, pt, ro, ru, sk, sv, th, tr, uk, vi, zh_hans, zh_hant

# AboutEmoji.howDoesItWorkDescription
source: The text is first converted to UTF-8, then encoded in Base64, after which each character is replaced with a corresponding emoji. This algorithm **supports any characters and languages**.
ar: يُحوَّل النص أولاً إلى UTF-8، ثم يُرمَّز بـ Base64، وبعد ذلك يُستبدل كل حرف بإيموجي مقابل. تدعم هذه الخوارزمية **أي أحرف ولغات**.
az: Mətn əvvəlcə UTF-8-ə çevrilir, sonra Base64-ə kodlaşdırılır və hər bir simvol uyğun emoji ilə əvəzlənir. Bu alqoritm **istənilən simvolu və dili dəstəkləyir**.
be: Тэкст спачатку пераўтвараецца ў UTF-8, затым кадуецца ў Base64, пасля чаго кожны сімвал замяняецца адпаведным эмодзі. Гэты алгарытм **падтрымлівае любыя сімвалы і мовы**.
bn: টেক্সট প্রথমে UTF-8-এ রূপান্তরিত হয়, তারপর Base64-এ এনকোড করা হয়, এরপর প্রতিটি অক্ষর একটি সংশ্লিষ্ট ইমোজি দিয়ে প্রতিস্থাপিত হয়। এই অ্যালগরিদম **যেকোনো অক্ষর ও ভাষা সমর্থন করে**।
ca: El text primer es converteix a UTF-8, després s'encoda en Base64 i, finalment, cada caràcter se substitueix per l'emoji corresponent. Aquest algoritme **admet qualsevol caràcter i idioma**.
cs: Text se nejprve převede do UTF-8, poté se zakóduje do Base64 a následně se každý znak nahradí odpovídajícím emojim. Tento algoritmus **podporuje jakékoli znaky i jazyky**.
da: Teksten konverteres først til UTF-8, derefter kodes den i Base64, hvorefter hvert tegn erstattes med den tilsvarende emoji. Denne algoritme **understøtter alle tegn og sprog**.
de: Der Text wird zuerst in UTF-8 konvertiert, dann in Base64 codiert, danach wird jedes Zeichen durch ein entsprechendes Emoji ersetzt. Dieser Algorithmus **unterstützt alle Zeichen und Sprachen**.
el: Το κείμενο μετατρέπεται πρώτα σε UTF-8, έπειτα κωδικοποιείται σε Base64 και στη συνέχεια κάθε χαρακτήρας αντικαθίσταται από το αντίστοιχο emoji. Αυτός ο αλγόριθμος **υποστηρίζει οποιονδήποτε χαρακτήρα και γλώσσα**.
es: El texto se convierte primero a UTF-8, luego se codifica en Base64, después de lo cual cada carácter se reemplaza por un emoji correspondiente. Este algoritmo **admite cualquier carácter y lenguaje**.
fi: Teksti muunnetaan ensin UTF-8-muotoon, sitten koodataan Base64:ään, minkä jälkeen jokainen merkki korvataan vastaavalla emojilla. Tämä algoritmi **tukee kaikkia merkkejä ja kieliä**.
fr: Le texte est d'abord converti en UTF-8, puis codé en Base64, après quoi chaque caractère est remplacé par un emoji correspondant. Cet algorithme **prend en charge tous les caractères et toutes les langues**.
he: הטקסט מומר תחילה ל-UTF-8, לאחר מכן מקודד ב-Base64, ואז כל תו מוחלף באמוג'י מתאים. אלגוריתם זה **תומך בכל תו ושפה**.
hi: पाठ को पहले UTF-8 में परिवर्तित किया जाता है, फिर Base64 में एन्कोड किया जाता है, इसके बाद प्रत्येक अक्षर को एक संबंधित इमोजी से बदल दिया जाता है। यह एल्गोरिदम **किसी भी अक्षर और भाषा का समर्थन करता है**।
hr: Tekst se najprije pretvara u UTF-8, zatim se kodira u Base64, nakon čega se svaki znak zamjenjuje odgovarajućim emojijem. Ovaj algoritam **podržava sve znakove i jezike**.
hu: A szöveget először UTF-8 formátumba konvertáljuk, majd Base64-be kódoljuk, ezután minden karaktert a megfelelő emojival helyettesítünk. Ez az algoritmus **bármilyen karaktert és nyelvet támogat**.
hy: Տեքստը նախ փոխակերպվում է UTF-8-ի, ապա կոդավորվում է Base64-ով, և յուրաքանչյուր նշան փոխարինվում է համապատասխան emoji-ով. Այս ալգորիթմը **աջակցում է ցանկացած նշանի և լեզվի**.
id: Teks terlebih dahulu dikonversi ke UTF-8, lalu dikodekan ke Base64, setelah itu setiap karakter diganti dengan emoji yang sesuai. Algoritme ini **mendukung karakter dan bahasa apa pun**.
is: Textanum er fyrst breytt í UTF-8, síðan kóðaður í Base64 og að lokum er hverjum staf skipt út fyrir samsvarandi emoji. Þetta reiknirit **styður hvaða stafi og tungumál sem er**.
it: Il testo viene prima convertito in UTF-8, quindi codificato in Base64, dopo di che ogni carattere viene sostituito con un'emoji corrispondente. Questo algoritmo **supporta tutti i caratteri e le lingue**.
ja: テキストは最初に UTF-8 に変換され、その後 Base64 にエンコードされ、各文字が対応する絵文字に置き換えられます。 このアルゴリズムは**すべての文字と言語をサポートします**。
ka: ტექსტი ჯერ გარდაიქმნება UTF-8-ში, შემდეგ კოდირდება Base64-ში, რის შემდეგაც თითოეული სიმბოლო იცვლება შესაბამისი ემოჯით. **ეს ალგორითმი მხარს უჭერს ნებისმიერ სიმბოლოსა და ენას.**
kk: Мәтін алдымен UTF-8-ге айналдырылады, содан кейін Base64-пен кодталады, содан кейін әрбір таңба сәйкес эмодзимен ауыстырылады. Бұл алгоритм **кез келген таңбалар мен тілдерді қолдайды**.
ko: 텍스트는 먼저 UTF-8로 변환된 후 Base64로 인코딩되며, 그 후 각 문자가 해당하는 이모지로 대체됩니다。 이 알고리즘은 **모든 문자와 언어를 지원합니다**。
ky: Текст адегенде UTF-8 ге айландырылат, андан соң Base64 менен кодделет, андан кийин ар бир белги тиешелүү эмодзи менен алмаштырылат. Бул алгоритм **каалаган белгилерди жана тилдерди колдойт**.
ms: Teks mula-mula ditukar kepada UTF-8, kemudian dikodkan dalam Base64, selepas itu setiap aksara digantikan dengan emoji sepadan. Algoritma ini **menyokong sebarang aksara dan bahasa**.
nb: Teksten konverteres først til UTF-8, deretter kodes den i Base64, og til slutt erstattes hvert tegn med tilsvarende emoji. Denne algoritmen **støtter alle tegn og språk**.
nl: De tekst wordt eerst geconverteerd naar UTF-8, vervolgens gecodeerd in Base64, waarna elk teken wordt vervangen door een overeenkomstige emoji. Dit algoritme **ondersteunt alle tekens en talen**.
pl: Tekst jest najpierw konwertowany do UTF-8, następnie kodowany w Base64, po czym każdy znak zastępowany jest odpowiadającym mu emoji. Ten algorytm **obsługuje dowolne znaki i języki**.
pt: O texto é primeiro convertido para UTF-8, depois codificado em Base64, após o que cada caractere é substituído por um emoji correspondente. Este algoritmo **suporta qualquer caractere e idioma**.
ro: Textul este mai întâi convertit în UTF-8, apoi este codificat în Base64, după care fiecare caracter este înlocuit cu emoji-ul corespunzător. Acest algoritm **acceptă orice caractere și limbi**.
ru: Текст сначала переводится в UTF-8, затем кодируется в Base64, после чего каждый символ заменяется соответствующим эмодзи. Благодаря этому алгоритм **поддерживает любые символы и языки**.
sk: Text sa najprv konvertuje do UTF-8, potom sa zakóduje do Base64 a napokon sa každý znak nahradí zodpovedajúcim emoji. Tento algoritmus **podporuje akékoľvek znaky aj jazyky**.
sv: Texten konverteras först till UTF-8, sedan kodas den i Base64, varefter varje tecken ersätts med en motsvarande emoji. Denna algoritm **stöder alla tecken och språk**.
th: ข้อความจะถูกแปลงเป็น UTF-8 ก่อน จากนั้นเข้ารหัสเป็น Base64 แล้วจึงแทนที่แต่ละอักขระด้วยอีโมจิที่สอดคล้องกัน. อัลกอริทึมนี้ **รองรับอักขระและทุกภาษา**.
tr: Metin önce UTF-8'e dönüştürülür, ardından Base64 ile kodlanır ve her karakter karşılık gelen bir emoji ile değiştirilir. Bu algoritma **herhangi bir karakteri ve dili destekler**.
uk: Текст спочатку конвертується у UTF-8, потім кодується в Base64, після чого кожен символ замінюється відповідним емодзі. Цей алгоритм **підтримує будь-які символи та мови**.
vi: Văn bản trước tiên được chuyển đổi sang UTF-8, sau đó mã hóa thành Base64, sau đó mỗi ký tự được thay thế bằng emoji tương ứng. Thuật toán này **hỗ trợ mọi ký tự và ngôn ngữ**.
zh_hans: 文本首先被转换为 UTF-8，然后编码为 Base64，之后每个字符都会被替换为相应的表情符号。 该算法**支持任何字符和语言**。
zh_hant: 文本首先被轉換為 UTF-8，然後編碼為 Base64，之後每個字符都會被替換為相應的表情符號。 該算法**支持任何字符和語言**。

# AboutEmoji.howDoesItWorkTitle
source: How does it work?
ar: كيف يعمل؟
az: Necə işləyir?
be: Як гэта працуе?
bn: এটি কিভাবে কাজ করে?
ca: Com funciona?
cs: Jak to funguje?
da: Hvordan fungerer det?
de: Wie funktioniert es?
el: Πώς λειτουργεί;
es: ¿Cómo funciona?
fi: Miten se toimii?
fr: Comment ça fonctionne ?
he: איך זה עובד?
hi: यह कैसे काम करता है?
hr: Kako funkcionira?
hu: Hogyan működik?
hy: Ինչպե՞ս է աշխատում
id: Bagaimana cara kerjanya?
is: Hvernig virkar það?
it: Come funziona?
ja: どのように動作しますか？
ka: როგორ მუშაობს?
kk: Бұл қалай жұмыс істейді?
ko: 어떻게 작동하나요？
ky: Бул кантип иштейт?
ms: Bagaimana ia berfungsi?
nb: Hvordan fungerer det?
nl: Hoe werkt het?
pl: Jak to działa?
pt: Como funciona?
ro: Cum funcționează?
ru: Как это работает?
sk: Ako to funguje?
sv: Hur fungerar det?
th: ทำงานอย่างไร?
tr: Nasıl çalışır?
uk: Як це працює?
vi: Nó hoạt động như thế nào?
zh_hans: 它是如何工作的？
zh_hant: 它是如何運作的？

# AboutEmoji.tipsDescription
source: **Do not use emoji encoding to protect sensitive information**. For secure data transmission, it’s better to **combine it with encryption** — for example, encrypt the text first and then convert the result into emojis.
ar: **لا تستخدم ترميز الإيموجي لحماية المعلومات الحساسة**. لنقل البيانات بأمان، من الأفضل **دمجه مع التشفير** — على سبيل المثال، شفّر النص أولاً ثم حوّل النتيجة إلى إيموجي.
az: **Emoji kodlaşdırmadan məxfi məlumatı qorumaq üçün istifadə etməyin**. Məlumatı təhlükəsiz ötürmək üçün onu **şifrələmə ilə birləşdirmək daha yaxşıdır** — məsələn, əvvəlcə mətni şifrələyin, sonra nəticəni emoji-lərə çevirin.
be: **Не выкарыстоўвайце кадаванне эмодзі для абароны канфідэнцыйнай інфармацыі**. Для бяспечнай перадачы даных лепш **спалучаць яго з шыфраваннем** — напрыклад, спачатку зашыфруйце тэкст, а затым пераўтварыце вынік у эмодзі.
bn: **সংবেদনশীল তথ্য সুরক্ষায় ইমোজি এনকোডিং ব্যবহার করবেন না**। নিরাপদ ডেটা প্রেরণের জন্য, **এনক্রিপশনের সাথে একত্রিত করা ভালো** — উদাহরণস্বরূপ, প্রথমে টেক্সট এনক্রিপ্ট করুন এবং তারপর ফলাফলটি ইমোজিতে রূপান্তর করুন।
ca: **No facis servir la codificació amb emojis per protegir informació sensible**. Per transmetre dades de manera segura, és millor **combinar-la amb xifratge** — per exemple, xifra primer el text i després converteix el resultat en emojis.
cs: **Nepoužívejte kódování pomocí emoji k ochraně citlivých informací**. Pro bezpečný přenos dat je lepší jej **kombinovat se šifrováním** — například nejprve text zašifrovat a poté výsledek převést na emoji.
da: **Brug ikke emoji-kodning til at beskytte følsomme oplysninger**. For sikker dataoverførsel er det bedre **at kombinere den med kryptering** — eksempelvis krypter teksten først og konverter derefter resultatet til emojis.
de: **Verwenden Sie keine Emoji-Codierung zum Schutz sensibler Informationen**. Für eine sichere Datenübertragung ist es besser, **es mit Verschlüsselung zu kombinieren** — z. B. den Text zuerst verschlüsseln und dann das Ergebnis in Emojis umwandeln.
el: **Μην χρησιμοποιείτε την κωδικοποίηση με emoji για την προστασία ευαίσθητων πληροφοριών**. Για ασφαλή μετάδοση δεδομένων είναι καλύτερο να την **συνδυάζετε με κρυπτογράφηση** — για παράδειγμα, κρυπτογραφήστε πρώτα το κείμενο και στη συνέχεια μετατρέψτε το αποτέλεσμα σε emoji.
es: **No uses la codificación con emojis para proteger información sensible**. Para la transmisión segura de datos, es mejor **combinarla con cifrado** — por ejemplo, primero cifrar el texto y luego convertir el resultado en emojis.
fi: **Älä käytä emoji-koodausta arkaluonteisen tiedon suojaamiseen**. Turvallista tiedonsiirtoa varten se on parempi **yhdistää salaukseen** — esimerkiksi salaa teksti ensin ja muuta sitten tulos emojeiksi.
fr: **N'utilisez pas le codage par emoji pour protéger des informations sensibles**. Pour une transmission sécurisée des données, il est préférable de **le combiner avec un chiffrement** — par exemple, chiffrer d'abord le texte, puis convertir le résultat en emojis.
he: **אל תשתמש בקידוד אמוג'י להגנה על מידע רגיש**. להעברת נתונים מאובטחת, עדיף **לשלב אותו עם הצפנה** — לדוגמה, הצפן את הטקסט תחילה ואז המר את התוצאה לאמוג'י.
hi: **संवेदनशील जानकारी की सुरक्षा के लिए इमोजी एन्कोडिंग का उपयोग न करें**। सुरक्षित डेटा ट्रांसमिशन के लिए, इसे **एन्क्रिप्शन के साथ संयोजित करना** बेहतर है — उदाहरण के लिए, पहले टेक्स्ट को एन्क्रिप्ट करें और फिर परिणाम को इमोजी में बदलें।
hr: **Ne koristite kodiranje emojijima za zaštitu osjetljivih informacija**. Za siguran prijenos podataka bolje ga je **kombinirati sa šifriranjem** — na primjer, najprije šifrirajte tekst, a zatim rezultat pretvorite u emojije.
hu: **Ne használd az emoji-kódolást érzékeny információk védelmére**. Biztonságos adattovábbításhoz jobb, ha **titkosítással kombinálod** — például először titkosítsd a szöveget, majd az eredményt alakítsd emoijokká.
hy: **Emoji կոդավորումը մի օգտագործեք գաղտնի տվյալները պաշտպանելու համար**. Տվյալները անվտանգ փոխանցելու համար այն ավելի լավ է **միավորել կոդավորման հետ** — օրինակ, նախ կոդավորեք տեքստը, հետո արդյունքը փոխակերպեք emoji-ների.
id: **Jangan gunakan pengodean emoji untuk melindungi informasi sensitif**. Untuk transmisi data yang aman, lebih baik **menggabungkannya dengan enkripsi** — misalnya enkripsi teks terlebih dahulu lalu ubah hasilnya menjadi emoji.
is: **Ekki nota emoji-kóðun til að vernda viðkvæmar upplýsingar**. Til öruggrar gagnaflutnings er betra að **sameina hana við dulkóðun** — til dæmis dulritaðu textann fyrst og breyttu síðan niðurstöðunni í emoji.
it: **Non utilizzare la codifica con emoji per proteggere informazioni sensibili**. Per una trasmissione sicura dei dati, è meglio **combinarla con la crittografia** — ad esempio, cifrare prima il testo e poi convertire il risultato in emoji.
ja: **機密情報を保護するために絵文字エンコーディングを使用しないでください**。 安全なデータ送信のためには、**暗号化と組み合わせる方が良い**です — 例えば、テキストをまず暗号化し、その後結果を絵文字に変換します。
ka: **არ გამოიყენოთ ემოჯის კოდირება მგრძნობიარე ინფორმაციის დასაცავად. **უსაფრთხო მონაცემთა გადაცემისთვის უმჯობესია **შიფრაციასთან კომბინაცია** — მაგალითად, ჯერ დაშიფრეთ ტექსტი და შემდეგ გადააქციეთ შედეგი ემოჯებად.
kk: **Эмодзи кодтауды құпия ақпаратты қорғау үшін пайдаланбаңыз**. Деректерді қауіпсіз жіберу үшін оны **шифрлаумен біріктіру** ұсынылады — мысалы, алдымен мәтінді шифрлаңыз, содан кейін нәтижені эмодзиге айналдырыңыз.
ko: **민감한 정보를 보호하기 위해 이모지 인코딩을 사용하지 마세요**。 데이터를 안전하게 전송하려면, **암호화와 결합하는 것이 좋습니다** — 예를 들어, 먼저 텍스트를 암호화한 후 결과를 이모지로 변환합니다。
ky: **Купуя маалыматтарды коргоо үчүн эмодзи коддоону колдонбоңуз**. Маалыматтарды коопсуз жөнөтүү үчүн аны **шифрлөө менен айкалыштыруу** сунушталат — мисалы, адегенде текстти шифрлеп, андан соң натыйжаны эмодзиге айландырыңыз.
ms: **Jangan gunakan pengekodan emoji untuk melindungi maklumat sensitif**. Untuk penghantaran data yang selamat, lebih baik **gabungkannya dengan penyulitan** — contohnya enkripsi teks terlebih dahulu kemudian tukar hasilnya kepada emoji.
nb: **Ikke bruk emoji-koding til å beskytte sensitiv informasjon**. For sikker dataoverføring er det bedre å **kombinere den med kryptering** — for eksempel krypter teksten først, og konverter deretter resultatet til emoji.
nl: **Gebruik geen emoji-codering om gevoelige informatie te beschermen**. Voor veilige gegevensoverdracht is het beter om **het met encryptie te combineren** — bijvoorbeeld eerst de tekst versleutelen en vervolgens het resultaat naar emoji's converteren.
pl: **Nie używaj kodowania emoji do ochrony wrażliwych informacji**. Aby bezpiecznie przesyłać dane, najlepiej **połączyć je z szyfrowaniem** — na przykład najpierw zaszyfruj tekst, a następnie zamień wynik na emoji.
pt: **Não use codificação por emoji para proteger informações sensíveis**. Para transmissão segura de dados, é melhor **combiná-la com criptografia** — por exemplo, criptografar o texto primeiro e depois converter o resultado em emojis.
ro: **Nu folosi codificarea cu emoji pentru a proteja informații sensibile**. Pentru transmiterea sigură a datelor, este mai bine să o **combini cu criptarea** — de exemplu, criptează mai întâi textul și abia apoi transformă rezultatul în emoji.
ru: **Не используйте кодирование в эмодзи для защиты важной информации**. Для безопасной передачи данных лучше **сочетать его с шифрованием** — например, сначала зашифровать текст, а затем преобразовать результат в эмодзи.
sk: **Nepoužívaj kódovanie emoji na ochranu citlivých informácií**. Pre bezpečný prenos dát je lepšie **skombinovať ho so šifrovaním** — napríklad najprv text zašifruj a až potom ho premeň na emoji.
sv: **Använd inte emoji-kodning för att skydda känslig information**. För säker datatransmission är det bättre att **kombinera den med kryptering** — till exempel kryptera texten först och sedan konvertera resultatet till emojis.
th: **อย่าใช้การเข้ารหัสอีโมจิเพื่อปกป้องข้อมูลที่ละเอียดอ่อน**. สำหรับการส่งข้อมูลอย่างปลอดภัย ควร **ผสานกับการเข้ารหัส** — เช่น เข้ารหัสข้อความก่อน แล้วค่อยแปลงผลลัพธ์เป็นอีโมจิ.
tr: **Hassas bilgileri korumak için emoji kodlaması kullanmayın**. Güvenli veri iletimi için, **bunu şifreleme ile birleştirmek** daha iyidir — örneğin, önce metni şifreleyin ve ardından sonucu emojilere dönüştürün.
uk: **Не використовуйте кодування емодзі для захисту конфіденційної інформації**. Для безпечної передачі даних краще **поєднувати його з шифруванням** — наприклад, спочатку зашифрувати текст, а потім перетворити результат на емодзі.
vi: **Không sử dụng mã hóa bằng emoji để bảo vệ thông tin nhạy cảm**. Để truyền dữ liệu an toàn, tốt hơn là **kết hợp nó với mã hóa** — ví dụ, trước tiên mã hóa văn bản, sau đó chuyển kết quả thành emoji.
zh_hans: **不要使用表情符号编码来保护敏感信息**。 为了安全地传输数据，最好**将其与加密结合使用** — 例如，先加密文本，然后将结果转换为表情符号。
zh_hant: **不要使用表情符號編碼來保護敏感信息**。 為了安全傳輸數據，最好**將其與加密結合使用**—例如，先加密文本，然後將結果轉換為表情符號。
